backend/app/controllers/restaurants_controller.rb

  def search
    @restaurants = Restaurant.search(
      name_or_description_cont: params[:q]
      ).result
---
SELECT "restaurants".* FROM "restaurants" WHERE ("restaurants"."name" LIKE '%Bravo%' OR "restaurants"."description" LIKE '%Bravo%')

  def set_restaurant
    @restaurant = Restaurant.find_by(id: params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]